BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1608.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="AVR8X" atdf:family="AVR MEGA" edc:arch="avr8" edc:hasfreeze="false" edc:name="ATmega1608" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="5.0" edc:minvoltage="1.8" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="false" edc:haslvp2="true">
    <edc:ProgrammingRowSize edc:nzsize="32" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="pgm"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="avr8" edc:name="avr8">
    <edc:MemTraits>
      <edc:ProgramMemTraits edc:addrinc="0x1" edc:locsize="0x2" edc:wordimpl="0xFFFF" edc:wordinit="0xFFFF" edc:wordsafe="0xFFFF" edc:wordsize="0xFFFF"/>
      <edc:DataMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFF" edc:wordinit="0xFF" edc:wordsafe="0xFF" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x810000"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="avr8">
    <edc:InstructionSet edc:instructionsetid="avr8base"/>
    <edc:InstructionSet edc:instructionsetid="avr8brk"/>
    <edc:InstructionSet edc:instructionsetid="avr8elpm"/>
    <edc:InstructionSet edc:instructionsetid="avr8movw"/>
    <edc:InstructionSet edc:instructionsetid="avr8des"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpm"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpmx"/>
    <edc:InstructionSet edc:instructionsetid="avr8mega"/>
    <edc:InstructionSet edc:instructionsetid="avr8sram"/>
    <edc:InstructionSet edc:instructionsetid="avr8spmx"/>
    <edc:InstructionSet edc:instructionsetid="avr8mul"/>
    <edc:InstructionSet edc:instructionsetid="avr8spm"/>
    <edc:InstructionSet edc:instructionsetid="avr8eind"/>
    <edc:InstructionSet edc:instructionsetid="avr8elpmx"/>
  </edc:InstructionSet>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="NMI" edc:desc="" edc:irq="1" ltx:memberofperipheral="CRCSCAN"/>
    <edc:Interrupt edc:cname="VLM" edc:desc="" edc:irq="2" ltx:memberofperipheral="BOD"/>
    <edc:Interrupt edc:cname="CNT" edc:desc="" edc:irq="3" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="PIT" edc:desc="" edc:irq="4" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="CCL" edc:desc="" edc:irq="5" ltx:memberofperipheral="CCL"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="6" ltx:memberofperipheral="PORTA"/>
    <edc:Interrupt edc:cname="LUNF" edc:desc="" edc:irq="7" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="OVF" edc:desc="" edc:irq="7" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="HUNF" edc:desc="" edc:irq="8" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="LCMP0" edc:desc="" edc:irq="9" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="CMP0" edc:desc="" edc:irq="9" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="CMP1" edc:desc="" edc:irq="10" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="LCMP1" edc:desc="" edc:irq="10" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="CMP2" edc:desc="" edc:irq="11" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="LCMP2" edc:desc="" edc:irq="11" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:cname="INT" edc:desc="" edc:irq="12" ltx:memberofperipheral="TCB0"/>
    <edc:Interrupt edc:cname="INT" edc:desc="" edc:irq="13" ltx:memberofperipheral="TCB1"/>
    <edc:Interrupt edc:cname="TWIS" edc:desc="" edc:irq="14" ltx:memberofperipheral="TWI0"/>
    <edc:Interrupt edc:cname="TWIM" edc:desc="" edc:irq="15" ltx:memberofperipheral="TWI0"/>
    <edc:Interrupt edc:cname="INT" edc:desc="" edc:irq="16" ltx:memberofperipheral="SPI0"/>
    <edc:Interrupt edc:cname="RXC" edc:desc="" edc:irq="17" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:cname="DRE" edc:desc="" edc:irq="18" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:cname="TXC" edc:desc="" edc:irq="19" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="20" ltx:memberofperipheral="PORTD"/>
    <edc:Interrupt edc:cname="AC" edc:desc="" edc:irq="21" ltx:memberofperipheral="AC0"/>
    <edc:Interrupt edc:cname="RESRDY" edc:desc="" edc:irq="22" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:cname="WCOMP" edc:desc="" edc:irq="23" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="24" ltx:memberofperipheral="PORTC"/>
    <edc:Interrupt edc:cname="INT" edc:desc="" edc:irq="25" ltx:memberofperipheral="TCB2"/>
    <edc:Interrupt edc:cname="RXC" edc:desc="" edc:irq="26" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:cname="DRE" edc:desc="" edc:irq="27" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:cname="TXC" edc:desc="" edc:irq="28" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="29" ltx:memberofperipheral="PORTF"/>
    <edc:Interrupt edc:cname="EE" edc:desc="" edc:irq="30" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:cname="RXC" edc:desc="" edc:irq="31" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:cname="DRE" edc:desc="" edc:irq="32" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:cname="TXC" edc:desc="" edc:irq="33" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="34" ltx:memberofperipheral="PORTB"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="" edc:irq="35" ltx:memberofperipheral="PORTE"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC0" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC0" edc:desc=""/>
    <edc:Peripheral edc:cname="BOD" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CLKCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="CPU" edc:desc=""/>
    <edc:Peripheral edc:cname="CPUINT" edc:desc=""/>
    <edc:Peripheral edc:cname="CRCSCAN" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSE" edc:desc=""/>
    <edc:Peripheral edc:cname="GPIO" edc:desc=""/>
    <edc:Peripheral edc:cname="LOCKBIT" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTA" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTB" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTC" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTD" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTE" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTF" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTMUX" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SIGROW" edc:desc=""/>
    <edc:Peripheral edc:cname="SLPCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="SPI0" edc:desc=""/>
    <edc:Peripheral edc:cname="SYSCFG" edc:desc=""/>
    <edc:Peripheral edc:cname="TCA0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB2" edc:desc=""/>
    <edc:Peripheral edc:cname="TWI0" edc:desc=""/>
    <edc:Peripheral edc:cname="USART0" edc:desc=""/>
    <edc:Peripheral edc:cname="USART1" edc:desc=""/>
    <edc:Peripheral edc:cname="USART2" edc:desc=""/>
    <edc:Peripheral edc:cname="USERROW" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTA" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTB" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTC" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTD" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTE" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTF" edc:desc=""/>
    <edc:Peripheral edc:cname="VREF" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
  </edc:PeripheralList>
  <edc:ProgramSpace>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x0" edc:endaddr="0x2000" edc:regionid="PROGMEM"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:magicoffset="0x800000">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFF" edc:mclr="0000000000000000" edc:nmmrid="60" edc:nzwidth="0x10" edc:por="0000000000000000"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="1" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="2" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="3" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="5" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="6" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="7" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="9" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="10" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="11" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R13" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="13" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R14" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="14" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R15" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="15" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R16" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R17" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="17" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R18" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="18" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R19" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="19" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R20" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R21" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="21" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R22" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="22" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R23" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="23" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R24" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R25" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="25" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R26" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="26" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R27" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="27" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R28" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R29" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="29" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R30" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="30" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="R31" edc:desc="General-Purpose Register" edc:impl="0xFF" edc:mclr="xxxxxxxx" edc:nmmrid="31" edc:nzwidth="0x8" edc:por="xxxxxxxx"/>
      </edc:NMMRPlace>
      <edc:EEDataSector atdf:pagesize="0x20" edc:beginaddr="0x811400" edc:endaddr="0x811500" edc:regionid="EEPROM"/>
      <edc:ConfigFuseSector atdf:pagesize="0x20" edc:beginaddr="0x1280" edc:endaddr="0x1289" edc:magicoffset="0x820000" edc:regionid="FUSES">
        <edc:DCRDef edc:_addr="0x1280" edc:access="nnnnnnnn" edc:cname="WDTCFG" edc:factorydefault="0x00" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="PERIOD" edc:desc="Watchdog Timeout Period" edc:nzwidth="0x4">
                <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="8CLK" edc:desc="8 cycles (8ms)" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="16CLK" edc:desc="16 cycles (16ms)" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="32CLK" edc:desc="32 cycles (32ms)" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="64CLK" edc:desc="64 cycles (64ms)" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="128CLK" edc:desc="128 cycles (0.128s)" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="256CLK" edc:desc="256 cycles (0.256s)" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="512CLK" edc:desc="512 cycles (0.512s)" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:DCRFieldSemantic edc:cname="1KCLK" edc:desc="1K cycles (1.0s)" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:DCRFieldSemantic edc:cname="2KCLK" edc:desc="2K cycles (2.0s)" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:DCRFieldSemantic edc:cname="4KCLK" edc:desc="4K cycles (4.1s)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:DCRFieldSemantic edc:cname="8KCLK" edc:desc="8K cycles (8.2s)" edc:when="(field &amp; 0xF) == 0x0B"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="WINDOW" edc:desc="Watchdog Window Timeout Period" edc:nzwidth="0x4">
                <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="8CLK" edc:desc="8 cycles (8ms)" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="16CLK" edc:desc="16 cycles (16ms)" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="32CLK" edc:desc="32 cycles (32ms)" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="64CLK" edc:desc="64 cycles (64ms)" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="128CLK" edc:desc="128 cycles (0.128s)" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="256CLK" edc:desc="256 cycles (0.256s)" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="512CLK" edc:desc="512 cycles (0.512s)" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:DCRFieldSemantic edc:cname="1KCLK" edc:desc="1K cycles (1.0s)" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:DCRFieldSemantic edc:cname="2KCLK" edc:desc="2K cycles (2.0s)" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:DCRFieldSemantic edc:cname="4KCLK" edc:desc="4K cycles (4.1s)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:DCRFieldSemantic edc:cname="8KCLK" edc:desc="8K cycles (8.2s)" edc:when="(field &amp; 0xF) == 0x0B"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1281" edc:access="nnnnnnnn" edc:cname="BODCFG" edc:factorydefault="0x00" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="SLEEP" edc:desc="BOD Operation in Sleep Mode" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="DIS" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLED" edc:desc="Sampled" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="ACTIVE" edc:desc="BOD Operation in Active Mode" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="DIS" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="SAMPLED" edc:desc="Sampled" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="ENWAKE" edc:desc="Enabled with wake-up halted until BOD is ready" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="SAMPFREQ" edc:desc="BOD Sample Frequency" edc:nzwidth="0x1">
                <edc:DCRFieldSemantic edc:cname="1KHZ" edc:desc="1kHz sampling frequency" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:DCRFieldSemantic edc:cname="125HZ" edc:desc="125Hz sampling frequency" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="LVL" edc:desc="BOD Level" edc:nzwidth="0x3">
                <edc:DCRFieldSemantic edc:cname="BODLEVEL0" edc:desc="1.8 V" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL1" edc:desc="2.1 V" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL2" edc:desc="2.6 V" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL3" edc:desc="2.9 V" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL4" edc:desc="3.3 V" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL5" edc:desc="3.7 V" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL6" edc:desc="4.0 V" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="BODLEVEL7" edc:desc="4.2 V" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1282" edc:access="n-----nn" edc:cname="OSCCFG" edc:factorydefault="0x02" edc:impl="0x83" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="FREQSEL" edc:desc="Frequency Select" edc:nzwidth="0x2">
                <edc:DCRFieldSemantic edc:cname="16MHZ" edc:desc="16 MHz" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="20MHZ" edc:desc="20 MHz" edc:when="(field &amp; 0x3) == 0x2"/>
              </edc:DCRFieldDef>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:DCRFieldDef edc:cname="OSCLOCK" edc:desc="Oscillator Lock" edc:nzwidth="0x1">
                <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
